#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//指针重点
//1.指针是什么
//2.指针和指针类型
//3.野指针
//4.指针运算
//5.指针和数组
//6.二级指针
//7.指针数组

/*指针:在计算机科学中,指针式编程语言中的一个对象,利用地址,它的值直接指向(point to)存在电脑存储器中另一个地方的值.
由于通过地址能找到所需的变量单元,可以说,地址指向该变量单元.因此,将地址形象化的称为"指针".
意思是通过它能找到以它为地址的内存单元*/

int main()
{
	int a = 10;   //在内存中开辟一块空间
	int* p = &a;  //指针变量 - 存放地址的变量(一般来讲,指针就是地址,地址就是指针)
	return 0;
}
//在32位的机器上,地址是32个0或者1组成二进制序列,那地址就得用4个字节的空间来存储,所以一个指针变量的大小就应该是4个字节
/*总结:1.指针就是变量，用来存放地址的变量.(存放在指针中的值都被当成地址处理),地址是唯一标示一块地址空间的.
       2.指针的大小在32位平台上4个字节,在64位平台上是8个字节.*/



//指针和指针类型
//指针类型的两个意义
int main()
{
	printf("%d\n", sizeof(char*)); 
	printf("%d\n", sizeof(short*));
	printf("%d\n", sizeof(int*));
	printf("%d\n", sizeof(double*));
	//都为指针,占4个字节

	int a = 0x11223344;
	int* pa = &a;
	char* pc = &a;
	printf("%p\n", pa);
	printf("%p\n", pc);
	//虽然存放的地址一致,但数据类型不兼容

	int a = 0x11223344;
	*pa = 0;  //&a的四个字节都发生改变,变为0

	char* pc = &a;
	*pc = 0;  //只有&c的第一个字节变为0
	return 0;
 }
//总结：指针类型决定了指针进行解引用操作的时候,对指针解引用的时候有多大的权限(能够访问空间的大小)
//int*p ; *p能够访问4个字节
//char*p ; *p能够访问1个字节
//double*p ; *p能够访问8个字节

int main()
{
	int a = 0x11223344;
	int* pa = &a;
	char* pc = &a;
	printf("%p\n", pa);  //006FF8DC
	printf("%p\n", pa+1);  //006FF8E0  跳了4个字节

	printf("%p\n", pc);  //006FF8DC
	printf("%p\n", pc+1);  //006FF8DD  跳了1个字节
	return 0;
}
//总结：指针类型决定了指针的步长(一步走多远)
//int*p ; p+1 --> 4
//char*p ; p+1 --> 1
//double*p ; p+1 --> 8

int main()
{
	int arr[10] = { 0 };  //数组中每一个元素都为整型
	int* p =arr; //数组名 - 首元素的地址  存放的为首元素的地址！！
	//若char* arr;利用下面的for循环则不能实现,只访问了10个字节,数组则有40个字节
	int i = 0;
	for (i = 0; i < 10; i++)
	{
		*(p + i) = 1;  //可将数组中的每个元素都变为1
	}
	return 0;
}
